/* 他，是时间的主人，拥有在同一天里穿越时空的能力。
他，热爱自习，经常一天自习25个小时，如果不是在自习，就是在去自习的路上。
他就是1521的常朔荣大神，被某位王助教宿舍的人亲切的称为“儿子”。
但是，他有一个不为人知的秘密：只要自习的时候，相邻座位有妹子，他就会失去意识，醒来后失去穿越时空的能力，无法回到正确的时空。
新学期开始了，常朔荣大神随意选择了一个时间进行穿越，走进了新主楼。他走进的这个教室只有一个小圆桌，圆桌周围均匀地摆着4个座位，编号1~4。给你这4个座位的状态，请你帮助常朔荣判断他能否在这个教室里安全坐下。
 * 输入：
 * 输入四个数，表示1~4号座位的状态。
0代表座位是空的，1代表座位上坐着男生，2代表座位上坐着女生。
 * 
 * 输出：
 *如果常朔荣可以坐下，输出“ConstSR is studying”
如果没有空座位，输出“ConstSR needs space”
如果有空座位但相邻位置有女生，输出“ConstSR hates girls”
 */

#include <iostream>

using namespace std;

int main() {

}
